## The points distribution for this case is as follows:
1. Read the dataset in a new python notebook.
2. Drop the columns which are unique for all users like IDs (2.5 points)
3. Distinguish the feature and target set (2.5 points)
4. Divide the data set into Train and test sets
5. Normalize the train and test data (2.5 points)
6. Initialize &amp; build the model (10 points)
7. Optimize the model (5 points)
9. Predict the results using 0.5 as a threshold (5 points)
10. Print the Accuracy score and confusion matrix (2.5 points)

In [18]:
# importing neccessary laibraries 
import numpy as np
import pandas as pd 
import tensorflow as tf
import keras

In [19]:
# Reading csv file using pandas 
df = pd.read_csv("Bank.csv")

In [20]:
# Checking al coloumns name 
df.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [21]:
 # distribution of target class can be understood 
df.groupby(df['Exited']).count()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
Exited,,,,,,,,,,,,,
0,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963
1,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037

>- Baised data or we may say unblance data is present

In [22]:
# Checking first five rows of our csv file 
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

>- Concerning about the 'row number' , 'CustomerId' and 'Surname' during Classification of coustomer doesent make sense hence droping them.

In [23]:
# droping Rownumber customer id and surname 
df_drop = df.drop(columns=['RowNumber','CustomerId','Surname'],axis=1)

In [24]:
print ('Shape of dataset',df_drop.shape)

Shape of dataset (10000, 11)

In [25]:
df_drop.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [26]:
# understanding data type of all coloumns 
df_drop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
CreditScore        10000 non-null int64
Geography          10000 non-null object
Gender             10000 non-null object
Age                10000 non-null int64
Tenure             10000 non-null int64
Balance            10000 non-null float64
NumOfProducts      10000 non-null int64
HasCrCard          10000 non-null int64
IsActiveMember     10000 non-null int64
EstimatedSalary    10000 non-null float64
Exited             10000 non-null int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [27]:
# Checking for Nan values 
df_drop.isna().sum().sum()

0

In [28]:
# Selecting dependtent and independent variable
X = df_drop.drop(columns=['Exited'],axis=1)
y = df_drop['Exited']

In [29]:
# Get dummies
X = pd.get_dummies(X, prefix_sep='_', drop_first=True)
# Get Dummies converts all catagorical columns into one hot encoding 
# Drop first = true automatically drops first columns of converted rows 
X.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_Germany,Geography_Spain,Gender_Male
0,619,42,2,0.00,1,1,1,101348.88,0,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,1,0
2,502,42,8,159660.80,3,1,0,113931.57,0,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,1,0

In [30]:
X.shape

(10000, 11)

In [33]:
# converterting catagorical variable into one hot encoding
y = np.array(y)

In [34]:
# Divide the data set into Train and test sets
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [35]:
print ('shape of X_train',X_train.shape)
print ('shape of X_test',X_test.shape)
print ('shape of y_train',y_train.shape)
print ('shape of y_test',y_test.shape)

shape of X_train (8000, 11)
shape of X_test (2000, 11)
shape of y_train (8000,)
shape of y_test (2000,)

y_test = tf.keras.utils.to_categorical(y_test)
y_train = tf.keras.utils.to_categorical(y_train)

In [36]:
print (tf.__version__)
print (X.shape)

2.0.0
(10000, 11)

>- .Normalize the train and test data (2.5 points)
>- Initialize & build the model (10 points)
>- Optimize the model (5 points)
>- Predict the results using 0.5 as a threshold (5 points)
>- Print the Accuracy score and confusion matrix (2.5 points)

In [37]:
from sklearn.preprocessing import Normalizer

transformer = Normalizer()
X_train = transformer.fit_transform(X_train)
X_test = transformer.transform(X_test)

In [38]:
# Creating Neural Network Model

In [39]:
# Initialize Sequential model
model = tf.keras.models.Sequential() # Instantiating keras sequential models from keras

In [40]:
# First layer (input layer) of  
model.add(tf.keras.layers.Dense(11, input_dim=11, kernel_initializer='uniform', activation='relu'))

In [42]:
# Hidden layer 1
model.add(tf.keras.layers.Dense(6, kernel_initializer='uniform', activation='relu'))
# (11+1)รท2=6
# batch Normalization 
model.add(tf.keras.layers.BatchNormalization())

In [43]:
#model.add(tf.keras.layers.Dense(6, kernel_initializer='uniform', activation='relu'))

In [44]:
# Final layer with activation function as softmax and 10 neurons 
model.add(tf.keras.layers.Dense(1, activation='sigmoid'))

#activiation: sigmoid becasue we are in an output layer. uses the Sigmoid activation function for  ฯ . 
#This is used instead of the ReLu function becasue it generates probabilities for the outcome.
#We want the probability that each customer leaves the bank.

In [48]:
# Create optimizer with non-default learning rate
sgd_optimizer = tf.keras.optimizers.SGD(lr=0.1)

# Compile the model
model.compile(optimizer=sgd_optimizer, loss='binary_crossentropy', metrics=['accuracy'])

In [49]:
# To visualize performance of traing and testing via server by using tensorboard
#tensorboard_callback = tf.keras.callbacks.TensorBoard(log_dir='log_dir_1')

In [50]:
# fiting our model with 10 epochs 
model.fit(X_train, y_train,epochs=10)#,callbacks=[tensorboard_callback]

Train on 8000 samples
Epoch 1/10
8000/8000 [==============================] - 3s 348us/sample - loss: 0.5036 - accuracy: 0.7945
Epoch 2/10
8000/8000 [==============================] - 2s 203us/sample - loss: 0.5025 - accuracy: 0.7945
Epoch 3/10
8000/8000 [==============================] - 2s 205us/sample - loss: 0.5024 - accuracy: 0.7945
Epoch 4/10
8000/8000 [==============================] - 2s 205us/sample - loss: 0.5030 - accuracy: 0.7945
Epoch 5/10
8000/8000 [==============================] - 2s 205us/sample - loss: 0.5019 - accuracy: 0.7945
Epoch 6/10
8000/8000 [==============================] - 2s 204us/sample - loss: 0.5021 - accuracy: 0.7945
Epoch 7/10
8000/8000 [==============================] - 2s 205us/sample - loss: 0.5022 - accuracy: 0.7945
Epoch 8/10
8000/8000 [==============================] - 2s 212us/sample - loss: 0.5017 - accuracy: 0.7945
Epoch 9/10
8000/8000 [==============================] - 2s 203us/sample - loss: 0.5021 - accuracy: 0.7945
Epoch 10/10
8000/8000 [==============================] - 2s 202us/sample - loss: 0.5019 - accuracy: 0.7945

In [51]:
# due un-blance data set our ANN model is learning all the atributes of lager Distribution. 
# i.e all the atributes of coustomer will not leave 
# Higly bais toward lager distribution

In [52]:
# Predicting 
y_pred = model.predict(X_test)
y_pred = (y_pred >= 0.5)

In [53]:
# Ploting Confussion matrix 
from sklearn.metrics import confusion_matrix,accuracy_score
cm = confusion_matrix(y_test, y_pred)

In [54]:
print (cm) # All the points are predicted as coustomer will not leave the bank

[[1607    0]
 [ 393    0]]

In [56]:
print ('Acurracy on test set is : ',accuracy_score(y_test,y_pred))

Acurracy on test set is :  0.8035